Autodesk.Revit.DB.ExternalService.ExternalService.IsRegisteredServerId(System.Guid)
Checks if the Id represents a valid server that has been registered for the service.
serverId:
An Id of a server
Returns:
True if the specified server is currently registed for this service, false otherwise.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.GetRegisteredServerIds
Returns Ids of all servers registered for the service.
Remarks:
The list includes all registered servers regardless of whether they are currently active or not.
Returns:
An array of Ids of all registered servers. The array may be empty.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.GetDefaultServerId
Returns the Id of the default server if one was assigned to the service.
Remarks:
Only mandatory services have default servers assigned.
Only built-in service can currently be mandatory. All third-party
services are optional and cannot (amd may not) have default servers.
Returns:
The GUID of the default server, or an invalid GUID if there is none assigned.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.GetServer(System.Guid)
Returns the instance that provides implementation for a registered server.
serverId:
Id of a registered server
Returns:
An instance of the server interface. NULL is returned if the server is invalid (e.g. destroyed)
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id is not a valid GUID value.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.RemoveServer(System.Guid)
Removes/unregisters a server from the service.
Remarks:
Only servers that have not been used yet (executed) in any still open document are allowed
to be removed. This applies to servers used in the current session or previous sessions.
It is possible to remove servers that are currently set as active, because it is possible
for a service to have no active server assigned. This does not apply to mandatory services, which
will always have at least one server registered - the default server - and at least one server
set as active at all times.
A server cannot be removed during the service's execution or when another server is just being
added or removed (e.g. during OnServersChanged call-back to the service).
Default server may not be removed. An attempt to do so will lead to an exception.
serverId:
Id of the server to be unregistered.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A server with this Id has not been registered for this service.
-or-
A server with this Id has already been used in a currently open document
-or-
The given serverId belongs to the default server of the service. Default servers may not be removed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
-or-
The service provider is not valid.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.AddServer(Autodesk.Revit.DB.ExternalService.IExternalServer)
Registers a server with its service.
Remarks:
Servers must be registered with their services. There has to be at least one server
registered for a service in order to be able to execute the service.
A server can be added only once. An attempt to add a server again will lead to an exception.
A server cannot be removed during the service's execution or when another server is just being
added or removed (e.g. during OnServersChanged call-back to the service).
Adding a server to a service does not make the server active yet. A registered server means
it may be used with the service, not that it is going to be automatically used (executed).
In order to make a service applicable to its service, the server must set as the active server
(or be a part of the set of active servers, in a multi-server service).
Servers can be registered at any time; registering does not need to happen during an application's
start-up, but it must happen - naturally - after the respective service has been registered.
Since all built-in services are automatically registered during initialization of Revit, their servers
can be added as early as during the OnStartup method. Third-party services, on the other hand, get
registered during the OnStartup method, therefore their servers need to be added later. The next
earliest opportunity for adding servers to a third-party service is on the ApplicationInitialized event.
server:
The instance of the server. The server must implement the interface provided by the service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Server object is not valid or its service Id does not match the service.
-or-
A server with the same Id has already been registered with the service.
-or-
The given server does not return valid values from the interface methods.
At least one of the Name, VendorId, Description, and ServerId is empty or invalid.
-or-
The server does not represent a server of a valid type to be used with the service.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
-or-
The service provider is not valid.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.GetPublicAccessKey
Access key to use to execute a service.
Remarks:
The service must be declared as public in order for callers be
able to invoke this method. Services that are not public can be
executed only by their owners (the ones who registered it).
Most services are not public and may only be executed by their
respective owners. To see whether a service was declared as public,
call the GetOptions method and check the IsPublic property.
Returns:
GUID representing the access key.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The service is not public, thus the access key cannot be obtained.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalService.GetOptions
A copy of the options the service was registered with.
Remarks:
The returned instance is mutable, but any changes
made there cannot be assigned back to the service.
Returns:
An instance of the options class.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalService.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalService.NumberOfServers
Indicates the number of servers currently registered with the service.
Remarks:
This is the muber of all registered servers, not just of the ones that are currently active.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.IsSerializable
Indicates whether executions of the service requires serialization in documents or not.
Remarks:
When a serializable service is executed in a document, a record about the executed
server (or servers) is stored in the document's history. This allows active servers
to be synchronized next time a saved document is opened in Revit.
Executions of a serializable service in a document must happen inside a transaction.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.VendorId
The vendor who provided the service
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.Description
The description for the service
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.Name
The name of the service
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService.ServiceId
The Id of the service
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalService
This base class represents an external service inside Revit application.
Remarks:
This is a base class from which SingleServerService and MultiServerService
classes are inherited. It implements all basic methods, but the two inherited
classes add more methods specific for that kind of service the class
represents. Use this base class to get information about a service and its
servers. Use the specific inherited classes to set or get active servers.
Summary of common methods:
Adding and removing a server to and from a serviceGetting information about a serviceQuerying a number of servers registered for a serviceAccessing servers currently registered for a service
Summary of the service-specific methods:
Getting and setting active server (or servers) for a service
Since:
2013